#include <iostream>
#include <windows.h>
using namespace std;
const int N_MISSIONS = 5;
string missions[N_MISSIONS] = {
	"1) Дата в виде текста",
	"2) Робот",
	"3) Количество учебных заданий",
	"4) Cтрока-описание числа",
	"5) Календарь"
};
string missions_full[N_MISSIONS] = {
	"1) Дан номер дня (1–31) и месяца(1–12) \n   Вывести дату в виде текста (например, «пятое января»)",
	"2) Робот может перемещаться в четырех направлениях \n   («С» – север, «З» – запад, «Ю» – юг, «В» – восток)\n   и принимать три цифровые команды: \n   0 – продолжать движение, 1 – поворот налево, -1 – поворот направо. \n   Дан символ C – исходное направление робота \n   и целое число N — посланная ему команда. \n   Вывести направление робота после выполнения полученной команды",
	"3) Дано целое число в диапазоне 10–40, \n   определяющее количество учебных заданий по некоторой теме. \n   Вывести строку-описание указанного количества заданий, \n   обеспечив правильное согласование числа со словами «учебное задание», \n   например: 18 — «восемнадцать учебных заданий»",
	"4) Дано целое число в диапазоне 100–999.\n   Вывести строку-описание данного числа, \n   например: 256 — «двести пятьдесят шесть»",
	"5) По номеру года определить его название,\n   если 1984 год — начало цикла: «год зеленой крысы»"
};

void mission_1() {
	string days[] = {"Первое","Второе","Третье","Четвёртое","Пятое","Шестое","Седьмое","Восьмое","Девятое","Десятое","Одиннадцатое","Двенадцатое","Тринадцатое","Четырнадцатое","Пятнадцатое","Шестнадцатое","Семнадцатое","Восемнадцатое","Девятнадцатое","Двадцатое","Двадцать первое","Двадцать второе","Двадцать третье","Двадцать четвёртое","Двадцать пятое","Двадцать шестое","Двадцать седьмое","Двадцать восьмое","Двадцать девятое","Тридцатое","Тридцать первое"};
	string months[] = {"января","февраля","марта","апреля","мая","июня","июля","августа","сентября","октября","ноября","декабря"};
	cout << missions_full[0] << endl;
	int d, m, y;
	bool x = false;
	cout << "   Введите год: ";
	cin >> y;
	if ((y % 4 == 0 && y % 100 != 0) || y % 400 == 0) {
		x = true;
	}
	do {
		cout << "   Введите номер месяца: ";
		cin >> m;
	} while (m < 0 && m > 12);
	
	if (m == 1 || m == 3 || m == 5 || m == 7 || m == 8 || m == 10 || m == 12) {
		do {
			cout << "   Введите номер дня(1-31): ";
			cin >> d;
		} while (d < 1 || d > 31);
	} else if (m == 2 && x == true) {
		do {
			cout << "   Введите номер февральского дня(1-29): ";
			cin >> d;
		} while (d < 1 || d > 29);
	} else if (m == 2 && x == false) {
		do {
			cout << "   Введите номер февральского дня(1-28): ";
			cin >> d;
		} while (d < 1 || d > 28);
	} else {
		do {
			cout << "   Введите номер дня(1-30): ";
			cin >> d;
		} while (d < 1 || d > 30);
	}
	cout << endl << "   " << days[d - 1] << " " << months[m - 1] << endl;

	cout << "____________________________________________________________\n";
}

void mission_2() {
	cout << missions_full[1] << endl;
	char command[10];
	cout << "   Введите команду: ";
	cin >> command;
	if (command[0] == 'с' || command[0] == 'С') {
		if (command[1] == '-' && command[2] == '1')
			cout << "   Шёл на СЕВЕР, повернул НАПРАВО, иду на ВОСТОК! \n";
		if (command[1] == '1')
			cout << "   Шёл на СЕВЕР, повернул НАЛЕВО, иду на ЗАПАД! \n";
		if (command[1] == '0')
			cout << "   Как шёл на СЕВЕР, так и иду! \n";
	}
	if (command[0] == 'в' || command[0] == 'В') {
		if (command[1] == '-' && command[2] == '1')
			cout << "   Шёл на ВОСТОК, повернул НАПРАВО, иду на ЮГ! \n";
		if (command[1] == '1')
			cout << "   Шёл на ВОСТОК, повернул НАЛЕВО, иду на СЕВЕР! \n";
		if (command[1] == '0')
			cout << "   Как шёл на ВОСТОК, так и иду! \n";
	}
	if (command[0] == 'ю' || command[0] == 'Ю') {
		if (command[1] == '-' && command[2] == '1')
			cout << "   Шёл на ЮГ, повернул НАПРАВО, иду на ЗАПАД! \n";
		if (command[1] == '1')
			cout << "   Шёл на ЮГ, повернул НАЛЕВО, иду на ВОСТОК! \n";
		if (command[1] == '0')
			cout << "   Как шёл на ЮГ, так и иду! \n";
	}
	if (command[0] == 'з' || command[0] == 'З') {
		if (command[1] == '-' && command[2] == '1')
			cout << "   Шёл на ЗАПАД, повернул НАПРАВО, иду на СЕВЕР! \n";
		if (command[1] == '1')
			cout << "   Шёл на ЗАПАД, повернул НАЛЕВО, иду на ЮГ! \n";
		if (command[1] == '0')
			cout << "   Как шёл на ЗАПАД, так и иду! \n";
	}

	cout << "____________________________________________________________\n";
}

void mission_3() {
	cout << missions_full[2] << endl;
	int num;
	string var = "учебных заданий", var1 = "учебное задание", var2 = "учебных задания";
	string numbers[] = {"десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать", "двадцать", "двадцать одно", "двадцать два", "двадцать три", "двадцать четыре", "двадцать пять", "двадцать шесть", "двадцать семь", "двадцать восемь", "двадцать девять", "тридцать", "тридцать одно", "тридцать два", "тридцать три", "тридцать четыре", "тридцать пять", "тридцать шесть", "тридцать семь", "тридцать восемь", "тридцать девять", "сорок"};
	do {
		cout << "   Введите число(10-40): ";
		cin >> num;
	} while (num < 10 || num > 40);
	if (num == 21 || num == 31)
		var = var1;
	else if ((num >= 22 && num <= 24) || (num >= 32 && num <= 34))
		var = var2;
	cout << "   " << num << " — «" << numbers[num - 10] << " " << var << "» \n";
	
	cout << "____________________________________________________________\n";
}

void mission_4() {
	cout << missions_full[3] << endl;
	int K;
	cout << "   Введите целое число в диапазоне 100–999:  ";
	cin >> K;
	cout << "   " << K << " - ";
	switch (K / 100) {
		case 1: cout << "Сто "; break;
		case 2: cout << "Двести "; break;
		case 3: cout << "Триста "; break;
		case 4: cout << "Четыреста "; break;
		case 5: cout << "Пятьсот "; break;
		case 6: cout << "Шестьсот "; break;
		case 7: cout << "Семьсот "; break;
		case 8: cout << "Восемьсот "; break;
		case 9: cout << "Девятьсот "; break;
	}
	switch ((K % 100) / 10) {
		case 0: break;
		case 2: cout << "двадцать "; break;
		case 3: cout << "тридцать "; break;
		case 4: cout << "сорок "; break;
		case 5: cout << "пятьдесят "; break;
		case 6: cout << "шестьдесят "; break;
		case 7: cout << "семьдесят "; break;
		case 8: cout << "восемьдесят "; break;
		case 9: cout << "девяносто "; break;
		case 1: switch (K % 100) {
			case 11: cout << "одиннадцать "; break;
			case 12: cout << "двенадцать "; break;
			case 13: cout << "тринадцать "; break;
			case 14: cout << "четырнадцать "; break;
			case 15: cout << "пятнадцать "; break;
			case 16: cout << "шестнадцать "; break;
			case 17: cout << "семнадцать "; break;
			case 18: cout << "восемнадцать "; break;
			case 19: cout << "девятнадцать "; break;
			case 10: cout << "десять "; break;
		}
	}
	if ((K % 100 / 10) != 1) {
		switch (K % 10) {
			case 0: break;
			case 1: cout << "один "; break;
			case 2: cout << "два "; break;
			case 3: cout << "три "; break;
			case 4: cout << "четыре "; break;
			case 5: cout << "пять "; break;
			case 6: cout << "шесть "; break;
			case 7: cout << "семь "; break;
			case 8: cout << "восемь "; break;
			case 9: cout << "девять "; break;
		}
	}
	cout << endl;
	cout << "____________________________________________________________\n";
}

void mission_5() {
	cout << missions_full[4] << endl;

	int n;
	cout << "   Год: ";
	cin >> n;
	cout << "   Год ";
	switch ((n) % 10) {
		case 0:
		case 1:
			cout << "бел";
			break;
		case 2:
		case 3:
			cout << "черн";
			break;
		case 4:
		case 5:
			cout << "зелён";
			break;
		case 6:
		case 7:
			cout << "красн";
			break;
		case 8:
		case 9:
			cout << "жёлт";
			break;
	}
	switch ((n + 1) % 5) {
		case 0:
		case 1:
		case 2:
		case 3:
		case 4:
		case 5:
		case 9:
		case 10:
		case 11:
			cout << "ой ";
			break;
		case 6:
		case 7:
		case 8:
			cout << "ого ";
			break;
	}
	switch ((n + 8) % 12) {
		case 0:
			cout << "крысы \n";
			break;
		case 1:
			cout << "коровы \n";
			break;
		case 2:
			cout << "тигра \n";
			break;
		case 3:
			cout << "зайца \n";
			break;
		case 4:
			cout << "дракона \n";
			break;
		case 5:
			cout << "змеи \n";
			break;
		case 6:
			cout << "лошади \n";
			break;
		case 7:
			cout << "овцы \n";
			break;
		case 8:
			cout << "обезьяны \n";
			break;
		case 9:
			cout << "курицы \n";
			break;
		case 10:
			cout << "собаки \n";
			break;
		case 11:
			cout << "свиньи \n";
			break;
	}
	cout << "____________________________________________________________\n";
}