#include <iostream>
#include <windows.h>
#include <cmath>
using namespace std;

void mission_1()
{
	cout << "1) Поменять местами содержимое переменных A и B и вывести новые значения A и B. \n";
	int a, b, c = 0;
	cout << "Введите A и B: ";
	cin >> a >> b;
	c = a;
	a = b;
	b = c;
	cout << "A = " << a << " B = " << b << endl;
	cout << "____________________________________________________________\n";
}

void mission_2()
{
	cout << "2) Даны переменные A, B, C. Изменить их значения, \n";
	cout << "   переместив содержимое A в B, B — в C, C — в A, \n";
	cout << "   и вывести новые значения переменных A, B, C. \n";
	int a, b, c, x, y;
	cout << "Введите A, B и C: ";
	cin >> a >> b >> c;
	x = c;
	y = b;
	b = a;
	c = y;
	a = x;
	cout << "A = " << a << " B = " << b << " C = " << c << endl;
	cout << "____________________________________________________________\n";
}

void mission_3()
{
	cout << "3) Даны переменные A, B, C. Изменить их значения, \n";
	cout << "   переместив содержимое A в C, C — в B, B — в A, \n";
	cout << "   и вывести новые значения переменных A, B, C. \n";
	int a, b, c, x, y;
	cout << "Введите A, B и C: ";
	cin >> a >> b >> c;
	x = c;
	y = b;
	c = a;
	b = x;
	a = y;
	cout << "A = " << a << " B = " << b << " C = " << c << endl;
	cout << "____________________________________________________________\n";
}

void mission_4()
{
	cout << "4) Найти значение функции y = 3x^6 - 6x^2 - 7 при данном значении x \n";
	double x, y;
	cout << "Введите x: ";
	cin >> x;
	y = 3 * pow(x, 6) - 6 * pow(x, 2) - 7;
	cout << "y = " << y << endl;
	cout << "____________________________________________________________\n";
}

void mission_5()
{
	cout << "5) Найти значение функции y = 4(x-3)^6 - 7(x-3)^3 + 2 при данном значении x \n";
	double x, y;
	cout << "Введите x: ";
	cin >> x;
	y = 4 * pow((x - 3), 6) - 7 * pow((x - 3), 3) + 2;
	cout << "y = " << y << endl;
	cout << "____________________________________________________________\n";
}

void mission_6()
{
	cout << "6) Дано число A. Вычислить A^8 , используя вспомогательную переменную и три операции умножения. \n";
	int a, b;
	cout << "Введите A: ";
	cin >> a;
	b = a * a; // квадрат b
	b = b * b; // четвертая степень b
	a = b * b; // восьмая степень a
	cout << "Результат: " << a << endl;
	cout << "____________________________________________________________\n";
}

void mission_7()
{
	cout << "7) Дано число A. Вычислить A^15, используя две вспомогательные переменные и пять операций умножения. \n";
	int a, b, c;
	cout << "Введите A: ";
	cin >> a;

	b = a * a; // квадрат b
	c = b * a; // куб c
	b = b * c; // пятая степень b
	c = b * b; // десятая степень c
	a = b * c; // пятнадцатая степень a

	cout << "Результат: " << a << endl;
	cout << "____________________________________________________________\n";
}